SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
/*!
    \file    gd32e23x_hal_adc.c
    \brief   ADC driver
    
    \version 2019-03-14, V1.0.0, firmware for GD32E23x
*/

/*
    Copyright (c) 2019, GigaDevice Semiconductor Inc.

    All rights reserved.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32e23x_hal.h"

/* delaytime for ADC enable and disable, in milliseconds */
#define ADC_ENABLE_DELAYTIME                    ((uint32_t) 2U)
#define ADC_DISABLE_DELAYTIME                   ((uint32_t) 2U)
/* delaytime for temperature sensor stabilization time, in microseconds */
#define ADC_TEMPSENSOR_DELAYTIME                ((uint32_t) 10U)

/* ADC conversion cycles(sampling time + conversion time of 12.5 ADC clock cycles, with resolution 12 bits) */
#define ADC_CONVERCYCLES_SAMT_1POINT5           ((uint32_t) 14U)
#define ADC_CONVERCYCLES_SAMT_7POINT5           ((uint32_t) 20U)
#define ADC_CONVERCYCLES_SAMT_13POINT5          ((uint32_t) 26U)
#define ADC_CONVERCYCLES_SAMT_28POINT5          ((uint32_t) 41U)
#define ADC_CONVERCYCLES_SAMT_41POINT5          ((uint32_t) 54U)
#define ADC_CONVERCYCLES_SAMT_55POINT5          ((uint32_t) 68U)
#define ADC_CONVERCYCLES_SAMT_71POINT5          ((uint32_t) 84U)
#define ADC_CONVERCYCLES_SAMT_239POINT5         ((uint32_t)252U)

/* ADC sampling time register1 mask */
#define ADC_SAMTALLCHS_1MASK2                   ((uint32_t)0x24924924U)
#define ADC_SAMTALLCHS_1MASK1                   ((uint32_t)0x12492492U)
#define ADC_SAMTALLCHS_1MASK0                   ((uint32_t)0x09249249U)
/* ADC sampling time register0 mask */
#define ADC_SAMTALLCHS_0MASK2                   ((uint32_t)0x00900000U)
#define ADC_SAMTALLCHS_0MASK1                   ((uint32_t)0x00480000U)
#define ADC_SAMTALLCHS_0MASK0                   ((uint32_t)0x00240000U)

/* enable ADC */
/* enable the ADC */
static int32_t _adc_enable(hal_adc_dev_struct *adc);
/*disable the ADC */
static int32_t _adc_disable(hal_adc_dev_struct *adc);
/* get the ADC enable state */
static FlagStatus _adc_enable_state_get(void);

/* DMA callback function */
/* ADC DMA transmission complete callback */
static void _adc_dma_transfer_complete(void *dma);
/* ADC DMA error callback */
static void _adc_dma_error(void *dma);

/* get ADC state and error */
/* set ADC state */
static void _adc_state_set(hal_adc_dev_struct *adc, hal_adc_state_enum adc_state);
/* clear ADC state */
static void _adc_state_clear(hal_adc_dev_struct *adc, hal_adc_state_enum adc_state);
/* set ADC error */
static void _adc_error_set(hal_adc_dev_struct *adc, hal_adc_error_enum adc_error);
/* clear ADC error */
static void _adc_error_clear(hal_adc_dev_struct *adc, hal_adc_error_enum adc_error);

/*!
    \brief      ADC init struct deinitialize
    \param[in]  hal_struct_type: the type of the structure
    \param[in]  p_struct: the pointer of the structure
    \param[out] none
    \retval     none
*/
void hal_adc_struct_init(hal_adc_struct_type_enum hal_struct_type, void *p_struct)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == p_struct){
        HAL_DEBUGE("pointer [*p_struct] value is invalid");
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    switch(hal_struct_type){
    case HAL_ADC_INIT_STRUCT:
        /* initialize ADC initialization structure with the default values */
        ((hal_adc_init_struct*)p_struct)->resolution_select                        = ADC_RESOLUTION_12B;
        ((hal_adc_init_struct*)p_struct)->data_alignment                           = ADC_DATAALIGN_RIGHT;
        ((hal_adc_init_struct*)p_struct)->scan_mode                                = DISABLE;
        ((hal_adc_init_struct*)p_struct)->oversample_config.oversample_mode        = DISABLE;
        ((hal_adc_init_struct*)p_struct)->oversample_config.oversample_ratio       = ADC_OVERSAMPLE_RATIO_MUL2;
        ((hal_adc_init_struct*)p_struct)->oversample_config.oversample_shift       = ADC_OVERSAMPLE_SHIFT_NONE;
        ((hal_adc_init_struct*)p_struct)->oversample_config.oversample_triggermode = ADC_OVERSAMPLE_ALL_CONVERT;
        break;

    case HAL_ADC_OVERSAMPLE_STRUCT:
        /* initialize ADC oversampling structure with the default values */
        ((hal_adc_oversample_struct*)p_struct)->oversample_mode        = DISABLE;
        ((hal_adc_oversample_struct*)p_struct)->oversample_ratio       = ADC_OVERSAMPLE_RATIO_MUL2;
        ((hal_adc_oversample_struct*)p_struct)->oversample_shift       = ADC_OVERSAMPLE_SHIFT_NONE;
        ((hal_adc_oversample_struct*)p_struct)->oversample_triggermode = ADC_OVERSAMPLE_ALL_CONVERT;
        break;
    
    case HAL_ADC_REGULARCH_INIT_STRUCT:
        /* initialize ADC regular channel initialization structure with the default values */
        ((hal_adc_regularch_init_struct*)p_struct)->length                       = 1U;
        ((hal_adc_regularch_init_struct*)p_struct)->exttrigger_select            = ADC_EXTTRIG_REGULAR_NONE;
        ((hal_adc_regularch_init_struct*)p_struct)->continuous_mode              = DISABLE;
        ((hal_adc_regularch_init_struct*)p_struct)->discontinuous_mode           = DISABLE;
        ((hal_adc_regularch_init_struct*)p_struct)->discontinuous_channel_length = 0U;
        break;
    
    case HAL_ADC_REGULARCH_CONFIG_STRUCT:
        /* initialize ADC regular channel configuration structure with the default values */
        ((hal_adc_regularch_config_struct*)p_struct)->regular_channel  = 0U;
        ((hal_adc_regularch_config_struct*)p_struct)->regular_sequence = ADC_REGULAR_SEQUENCE_0;
        ((hal_adc_regularch_config_struct*)p_struct)->sample_time      = ADC_SAMPLETIME_7POINT5; 
        break;

