SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    case HAL_ADC_INSERTEDCH_INIT_STRUCT:
        /* initialize ADC inserted channel initialization structure with the default values */
        ((hal_adc_insertedch_init_struct*)p_struct)->length             = 0U;
        ((hal_adc_insertedch_init_struct*)p_struct)->exttrigger_select  = ADC_EXTTRIG_REGULAR_NONE;
        ((hal_adc_insertedch_init_struct*)p_struct)->auto_convert       = DISABLE;
        ((hal_adc_insertedch_init_struct*)p_struct)->discontinuous_mode = DISABLE;
        break;
    
    case HAL_ADC_INSERTEDCH_CONFIG_STRUCT:
        /* initialize ADC inserted channel configuration structure with the default values */
        ((hal_adc_insertedch_config_struct*)p_struct)->inserted_channel  = 0U;
        ((hal_adc_insertedch_config_struct*)p_struct)->inserted_sequence = ADC_INSERTED_SEQUENCE_0;
        ((hal_adc_insertedch_config_struct*)p_struct)->sample_time       = ADC_SAMPLETIME_7POINT5;
        ((hal_adc_insertedch_config_struct*)p_struct)->inserted_offset   = 0U;
        break;
    
    case HAL_ADC_IRQ_STRUCT:
        /* initialize ADC device interrupt callback function pointer structure with the default values */
        ((hal_adc_irq_struct*)p_struct)->adc_watchdog_handle = NULL;
        ((hal_adc_irq_struct*)p_struct)->adc_eoc_handle      = NULL;
        ((hal_adc_irq_struct*)p_struct)->adc_eoic_handle     = NULL; 
        break;

    case HAL_ADC_DMA_HANDLE_CB_STRUCT:
        /* initialize ADC DMA callback function pointer structure with the default values */
        ((hal_adc_dma_handle_cb_struct*)p_struct)->transcom_handle = NULL;
        ((hal_adc_dma_handle_cb_struct*)p_struct)->error_handle    = NULL;
        break;
    
    case HAL_ADC_WATCHDOG_STRUCT:
        /* initialize ADC watchdog configuration structure with the default values */
        ((hal_adc_watchdog_struct*)p_struct)->watchdog_mode  = ADC_WATCHDOG_NONE;
        ((hal_adc_watchdog_struct*)p_struct)->single_channel = 0U;
        ((hal_adc_watchdog_struct*)p_struct)->low_threshold  = 0U;
        ((hal_adc_watchdog_struct*)p_struct)->high_threshold = 0U;
        break;
    
    case HAL_ADC_DEV_STRUCT:
        /* initialize ADC device information structure with the default values */
        ((hal_adc_dev_struct*)p_struct)->adc_irq.adc_eoc_handle      = NULL;
        ((hal_adc_dev_struct*)p_struct)->adc_irq.adc_eoic_handle     = NULL;
        ((hal_adc_dev_struct*)p_struct)->adc_irq.adc_watchdog_handle = NULL;
        ((hal_adc_dev_struct*)p_struct)->p_dma_adc                   = NULL;
        ((hal_adc_dev_struct*)p_struct)->adc_dma.transcom_handle     = NULL;
        ((hal_adc_dev_struct*)p_struct)->adc_dma.error_handle        = NULL;
        ((hal_adc_dev_struct*)p_struct)->error_state                 = ADC_ERROR_NONE;
        ((hal_adc_dev_struct*)p_struct)->state                       = ADC_STATE_RESET;
        break;

    default:
        HAL_DEBUGW("parameter [hal_struct_type] value is undefine");
        break;
    }
}

/*!
    \brief      deinitialize ADC device structure and init structure
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_deinit(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    _adc_state_set(adc, ADC_STATE_BUSY_SYSTEM);
    
    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc)){
        /* deinit ADC */
        adc_deinit();
        adc->error_state = ADC_ERROR_NONE;
        adc->state = ADC_STATE_RESET;
    }else{
        return HAL_ERR_HARDWARE;
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      initialize ADC
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_init: the pointer of ADC init structure
                  resolution_select: ADC_RESOLUTION_12B, ADC_RESOLUTION_10B, ADC_RESOLUTION_8B, ADC_RESOLUTION_6B
                  data_alignment: ADC_DATAALIGN_RIGHT, ADC_DATAALIGN_LEFT
                  scan_mode: ENABLE, DISABLE
                  oversample_config:
                    the argument could be selected from structure <hal_adc_oversample_struct>
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_init(hal_adc_dev_struct *adc, hal_adc_init_struct *p_init)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_init)){
        HAL_DEBUGE("pointer [adc] or [p_init] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(ADC_STATE_RESET == (hal_adc_state_get(adc))){
        adc->error_state = ADC_ERROR_NONE;
    }
    
    if((HAL_ERR_NONE == _adc_disable(adc)) && (RESET == ((hal_adc_error_get(adc)) & ADC_ERROR_SYSTEM))){
        /* set ADC state  */
        _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc, ADC_STATE_BUSY_SYSTEM);

        /* init ADC */
        /* 1.ADC data resolution select */
        /* ADC data resolution select can be updated only when ADC is disabled*/
        if(RESET == _adc_enable_state_get()){
            adc_resolution_config(p_init->resolution_select);
        }
        /* 2.ADC data alignment config */
        adc_data_alignment_config(p_init->data_alignment);

        /* 3.ADC scan mode config */
        adc_special_function_config(ADC_SCAN_MODE, p_init->scan_mode);

        /* 4.ADC oversampling mode config */
        if(ENABLE == p_init->oversample_config.oversample_mode){
            adc_oversample_mode_config(p_init->oversample_config.oversample_triggermode, p_init->oversample_config.oversample_shift,
                                       p_init->oversample_config.oversample_ratio);
            /* enable ADC oversample mode */
            adc_oversample_mode_enable();
        }else{
            if(SET == __HAL_ADC_GET_OVERSAMPLE_ENABLE){
                /* disable ADC oversample mode */
                adc_oversample_mode_disable();
            }
        }
    }else{
        return HAL_ERR_HARDWARE;
    }
    
