SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      ADC calibration
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_calibration(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc)){
        /* set ADC state  */
        _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc, ADC_STATE_BUSY_SYSTEM);

        /* enable the ADC */
        _adc_enable(adc);
        /* ADC calibration and reset calibration */
        adc_calibration_enable();
        
        /* set ADC state  */
        _adc_state_clear(adc, ADC_STATE_BUSY_SYSTEM);
        _adc_state_set(adc, ADC_STATE_READY);
    }else{
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize ADC regular channel
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rinit: the pointer of ADC regular group init structure
                  length: 1-16
                  exttrigger_select: ADC_EXTTRIG_REGULAR_T0_CH0, ADC_EXTTRIG_REGULAR_T0_CH1, ADC_EXTTRIG_REGULAR_T0_CH2
                                     ADC_EXTTRIG_REGULAR_T2_TRGO, ADC_EXTTRIG_REGULAR_T14_CH0, ADC_EXTTRIG_REGULAR_EXTI_11,
                                     ADC_EXTTRIG_REGULAR_NONE
                  continuous_mode: ENABLE, DISABLE
                  discontinuous_mode: ENABLE, DISABLE
                  discontinuous_channel_length: 1-8
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_regular_channel_init(hal_adc_dev_struct *adc, hal_adc_regularch_init_struct *p_rinit)
{
    uint32_t reg_temp;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_rinit)){
        HAL_DEBUGE("pointer [adc] or [p_rinit] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    if(ADC_STATE_RESET == (hal_adc_state_get(adc))){
        adc->error_state = ADC_ERROR_NONE;
    }

    if((HAL_ERR_NONE == _adc_disable(adc)) && (RESET == ((hal_adc_error_get(adc)) & ADC_ERROR_SYSTEM))){
        /* set ADC state  */
        _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc, ADC_STATE_BUSY_SYSTEM);

        /* init ADC regular channel */
        /* 1.ADC channel length config */
        adc_channel_length_config(ADC_REGULAR_CHANNEL, p_rinit->length);
        /* 2.ADC regular channel external trigger config */
        adc_external_trigger_source_config(ADC_REGULAR_CHANNEL, p_rinit->exttrigger_select); 

        /* 3.ADC continuous mode config */
        adc_special_function_config(ADC_CONTINUOUS_MODE, p_rinit->continuous_mode);
        /* 4.ADC discontinuous mode config */
        if(ENABLE == p_rinit->discontinuous_mode){
            if(DISABLE == p_rinit->continuous_mode){
                reg_temp = ADC_CTL0;
                /* clear DISRC bit and DISNUM bit */
                reg_temp &= ~((uint32_t)ADC_CTL0_DISRC);
                reg_temp &= ~((uint32_t)ADC_CTL0_DISNUM);
                reg_temp |= CTL0_DISNUM(((uint32_t)(p_rinit->discontinuous_channel_length) - 1U));
                reg_temp |= (uint32_t)ADC_CTL0_DISRC;
                ADC_CTL0 = reg_temp;
            }else{
                ADC_CTL0 &= ~((uint32_t)ADC_CTL0_DISRC);
                _adc_error_set(adc, ADC_ERROR_CONFIG);
                _adc_error_set(adc, ADC_ERROR_SYSTEM);
            }
        }
    }else{
        return HAL_ERR_HARDWARE;
    }
    
    return HAL_ERR_NONE;
}

/*!
    \brief      configure ADC regular channel
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_rchannel: the pointer of ADC regular channel configuration structure
                  regular_channel: ADC_CHANNEL_x(x=0..9,16,17)
                  regular_sequence:
                    the argument could be selected from enumeration <hal_adc_regularch_sequence_enum>
                  sample_time: ADC_SAMPLETIME_1POINT5, ADC_SAMPLETIME_7POINT5, ADC_SAMPLETIME_13POINT5, ADC_SAMPLETIME_28POINT5,
                                ADC_SAMPLETIME_41POINT5, ADC_SAMPLETIME_55POINT5, ADC_SAMPLETIME_71POINT5, ADC_SAMPLETIME_239POINT5
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_regular_channel_config(hal_adc_dev_struct *adc, hal_adc_regularch_config_struct *p_rchannel)
{
    __IO uint32_t wait_loop = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_rchannel) ){
        HAL_DEBUGE("pointer [adc] or [p_rchannel] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    /* configure ADC regular channel */
    adc_regular_channel_config(p_rchannel->regular_sequence, p_rchannel->regular_channel, p_rchannel->sample_time);
    
    /* enable temperature sensor and VREFINT measurement */
    if((ADC_CHANNEL_TEMPSENSOR == p_rchannel->regular_channel) || (ADC_CHANNEL_VREFINT == p_rchannel->regular_channel)){
        if(RESET == __HAL_ADC_GET_TEMPVREF_ENABLE){
            /* enable the temperature sensor and Vrefint channel */
            ADC_CTL1 |= ADC_CTL1_TSVREN;
            if(ADC_CHANNEL_TEMPSENSOR == p_rchannel->regular_channel){
                /* compute number of CPU cycles to wait for */
                wait_loop = (ADC_TEMPSENSOR_DELAYTIME * (SystemCoreClock / 1000000));
                /* delay for temperature sensor stabilization time */
                while(wait_loop != 0){
                    wait_loop--;
                }
            } 
        }
    }
    return HAL_ERR_NONE;
}

/*!
    \brief      start ADC module function
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_start(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
        
