SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc)){
        /* set ADC state */
        _adc_state_clear(adc, ADC_STATE_READY);
        _adc_state_clear(adc, ADC_STATE_REGULAR_EOC);
        _adc_state_set(adc, ADC_STATE_REGULAR_BUSY);

        /* if ADC configured in automatic inserted mode */
        if(SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV){
            _adc_state_clear(adc, ADC_STATE_INSERTED_EOC);
            _adc_state_set(adc, ADC_STATE_INSERTED_BUSY);
        }
        /* check if an inserted conversion is ongoing */
        if(SET == ((hal_adc_state_get(adc)) & ADC_STATE_INSERTED_BUSY)){
            _adc_error_clear(adc, ADC_ERROR_DMA);
        }else{
            adc->error_state = ADC_ERROR_NONE;
        }

        adc->adc_irq.adc_eoc_handle = p_irq->adc_eoc_handle;
        
        /* clear ADC interrupt flag */
        adc_interrupt_flag_clear(ADC_INT_FLAG_EOC);
        /* enable ADC end of group conversion flag */
        adc_interrupt_enable(ADC_INT_EOC);
        /* enable the conversion of regular group */
        if(ADC_EXTTRIG_REGULAR_NONE == __HAL_ADC_GET_REGULARCH_EXTTRIGGER){
            /* enable software trigger */
            adc_external_trigger_config(ADC_REGULAR_CHANNEL, ENABLE);
            adc_software_trigger_enable(ADC_REGULAR_CHANNEL);
        }else{
            /* enable external trigger */
            adc_external_trigger_config(ADC_REGULAR_CHANNEL, ENABLE);
        }
    }else{
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop ADC EOC interrupt
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_stop_interrupt(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is disabled */
    if(HAL_ERR_NONE == _adc_disable(adc)){
        /* end of group conversion interrupt */
        adc_interrupt_disable(ADC_INT_EOC);
        adc->adc_irq.adc_eoc_handle = NULL;
        
        /* set ADC state */
        _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc, ADC_STATE_READY);
    }else{
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      start ADC EOC DMA request 
    \param[in]  adc: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  pdata: the source memory buffer address
    \param[in]  length: the number of data to be transferred from source to destination
    \param[in]  dmacb: ADC DMA transfer complete interrupt callback function structure
                  transcom_handle: DMA transfer complete interrupt handler 
                  error_handle: ADC DMA error interrupt handler
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_VAL, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_start_dma(hal_adc_dev_struct *adc, uint32_t* pdata, uint32_t length, hal_adc_dma_handle_cb_struct *dmacb)
{
    hal_dma_irq_struct dma_irq;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == pdata) || (NULL == dmacb)){
        HAL_DEBUGE("pointer [adc] or [pdata] or [dmacb] address is invalid");
        return HAL_ERR_ADDRESS;
    }
    if(0U == length){
        HAL_DEBUGE("parameter [length] value is invalid");
        return HAL_ERR_VAL;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    hal_dma_struct_init(HAL_DMA_IRQ_STRUCT, &dma_irq);
    
    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc)){
        /* set ADC state */
        _adc_state_clear(adc, ADC_STATE_READY);
        _adc_state_clear(adc, ADC_STATE_REGULAR_EOC);
        _adc_state_set(adc, ADC_STATE_REGULAR_BUSY);

        /* if conversions on group regular are also triggering group inserted */
        if(SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV){
            _adc_state_clear(adc, ADC_STATE_INSERTED_EOC);
            _adc_state_set(adc, ADC_STATE_INSERTED_BUSY);
        }
        /* check if an inserted conversion is ongoing */
        if(SET == ((hal_adc_state_get(adc)) & ADC_STATE_INSERTED_BUSY)){
            _adc_error_clear(adc, ADC_ERROR_DMA);
        }else{
            adc->error_state = ADC_ERROR_NONE;
        }

        /* clear ADC flag */
        adc_flag_clear(ADC_FLAG_EOC);
        
        adc->adc_dma.transcom_handle = dmacb->transcom_handle;
        adc->adc_dma.error_handle    = dmacb->error_handle;

        /* set the DMA transfer complete callback */
        dma_irq.full_finish_handle = _adc_dma_transfer_complete;
        dma_irq.error_handle       = _adc_dma_error;
        if(NULL != adc->p_dma_adc->dma_irq.half_finish_handle){
            dma_irq.half_finish_handle = adc->p_dma_adc->dma_irq.half_finish_handle;
        }

        /* enable ADC DMA mode */
        adc_dma_mode_enable();
        /* start the DMA channel */
        hal_dma_start_interrupt(adc->p_dma_adc, (uint32_t)&ADC_RDATA, (uint32_t)pdata, length, &dma_irq);

        /* enable the conversion of regular group */
        if(ADC_EXTTRIG_REGULAR_NONE == __HAL_ADC_GET_REGULARCH_EXTTRIGGER){
            /* enable software trigger */
            adc_external_trigger_config(ADC_REGULAR_CHANNEL, ENABLE);
            adc_software_trigger_enable(ADC_REGULAR_CHANNEL);

        }else{
            /* enable external trigger */
            adc_external_trigger_config(ADC_REGULAR_CHANNEL, ENABLE);
        }
    }else{
        return HAL_ERR_HARDWARE;
    }

