SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of regular group, disable ADC DMA mode and disable ADC
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_stop_dma(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_disable(adc)){
        /* disable ADC DMA mode */
        adc_dma_mode_disable();
        /* disable the DMA channel */
        hal_dma_stop(adc->p_dma_adc);
        
        /* reset DMA callback function interrupt handler */
        adc->adc_dma.transcom_handle = NULL;
        adc->adc_dma.error_handle = NULL;
        
        /* set ADC state */
        _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
        _adc_state_set(adc, ADC_STATE_READY);
    }else{
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      initialize ADC inserted channel
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_iinit: the pointer of ADC inserted group init structure
                  length: 1-4
                  exttrigger_select: ADC_EXTTRIG_INSERTED_T0_TRGO, ADC_EXTTRIG_INSERTED_T0_CH3, ADC_EXTTRIG_INSERTED_T2_CH3,
                                              ADC_EXTTRIG_INSERTED_T14_TRGO, ADC_EXTTRIG_INSERTED_EXTI_15, ADC_EXTTRIG_INSERTED_NONE,
                  auto_convert: ENABLE, DISABLE
                  discontinuous_mode: ENABLE, DISABLE
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_channel_init(hal_adc_dev_struct *adc, hal_adc_insertedch_init_struct *p_iinit)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_iinit) ){
        HAL_DEBUGE("pointer [adc] or [p_iinit] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* ADC inserted channel initialize */ 
    /* ADC inserted channel length config */
    adc_channel_length_config(ADC_INSERTED_CHANNEL, p_iinit->length);
    
    /* if ADC is disabled */
    if(RESET == _adc_enable_state_get()){
        /* ADC inserted channel external trigger config */
        adc_external_trigger_source_config(ADC_INSERTED_CHANNEL, p_iinit->exttrigger_select);
        /* enable ADC */
        ADC_CTL1 |= (uint32_t)ADC_CTL1_ADCON;
    }

    /* ADC inserted channel group convert automatically config */
    if(ENABLE == p_iinit->auto_convert){
        if(ADC_EXTTRIG_INSERTED_NONE == p_iinit->exttrigger_select){
            adc_special_function_config(ADC_INSERTED_CHANNEL_AUTO, p_iinit->auto_convert);
        }else{
            _adc_error_set(adc, ADC_ERROR_CONFIG);
            return HAL_ERR_NO_SUPPORT;  
        }
    }
    
    /* ADC discontinuous mode config */
    if(ENABLE == p_iinit->discontinuous_mode){
        /* inserted discontinuous can be enabled only if auto-inserted mode is disabled.   */
        if(DISABLE == p_iinit->auto_convert){
            ADC_CTL0 |= (uint32_t)ADC_CTL0_DISIC;
        }else{
            _adc_error_set(adc, ADC_ERROR_CONFIG);
            return HAL_ERR_NO_SUPPORT;   
        }
    }else{
        ADC_CTL0 &= ~((uint32_t)ADC_CTL0_DISIC);
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      configure ADC inserted channel
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_ichannel: the pointer of ADC inserted channel configuration structure
                  inserted_channel: ADC_CHANNEL_x(x=0..9,16,17)
                  inserted_sequence:
                    the argument could be selected from enumeration <hal_adc_insertedch_sequence_enum>
                  sample_time: ADC_SAMPLETIME_1POINT5, ADC_SAMPLETIME_7POINT5, ADC_SAMPLETIME_13POINT5, ADC_SAMPLETIME_28POINT5,
                                ADC_SAMPLETIME_41POINT5, ADC_SAMPLETIME_55POINT5, ADC_SAMPLETIME_71POINT5, ADC_SAMPLETIME_239POINT5
                  inserted_offset: the offset data(0-0x0FFF)
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_channel_config(hal_adc_dev_struct *adc, hal_adc_insertedch_config_struct *p_ichannel)
{
    uint32_t reg_temp;
    uint32_t length_temp;
    __IO uint32_t wait_loop = 0;
    uint8_t inserted_length;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_ichannel) ){
        HAL_DEBUGE("pointer [adc] or [p_ichannel] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* ADC inserted channel length */
    length_temp = ((ADC_ISQ & ADC_ISQ_IL) >> 20U) + 1U;
    
    if(RESET == __HAL_ADC_GET_SCAN_MODE){
        if(ADC_INSERTED_SEQUENCE_0 == p_ichannel->inserted_sequence){
           /* ADC inserted channel config */ 
           adc_inserted_channel_config(ADC_INSERTED_SEQUENCE_0, p_ichannel->inserted_channel, p_ichannel->sample_time);
        }else{
            _adc_error_set(adc, ADC_ERROR_CONFIG);
            return HAL_ERR_NO_SUPPORT;   
        }
    }else{
        if(p_ichannel->inserted_sequence <= (length_temp -1U)){
            /* ADC inserted channel config */
           adc_inserted_channel_config(p_ichannel->inserted_sequence, p_ichannel->inserted_channel, p_ichannel->sample_time);
        }else{
            /* clear parameters */
            ADC_ISQ &= ~((uint32_t)ADC_ISQ_IL);

            inserted_length = (uint8_t)(length_temp - 1U);
            reg_temp = ADC_ISQ;
            reg_temp &= ~((uint32_t)(ADC_ISQ_ISQN << (15U - (inserted_length - (p_ichannel->inserted_sequence))*5U)));
            ADC_ISQ = reg_temp;
        }
    }

    /* ADC inserted channel offset config */
    adc_inserted_channel_offset_config(p_ichannel->inserted_sequence, p_ichannel->inserted_offset);
    
    /* enable temperature sensor and VREFINT measurement */
    if((ADC_CHANNEL_TEMPSENSOR == p_ichannel->inserted_channel) || (ADC_CHANNEL_VREFINT == p_ichannel->inserted_channel)){
        if(RESET == __HAL_ADC_GET_TEMPVREF_ENABLE){
            ADC_CTL1 |= ADC_CTL1_TSVREN;
            if(ADC_CHANNEL_TEMPSENSOR == p_ichannel->inserted_channel){
                /* delay for temperature sensor stabilization time */
                /* compute number of CPU cycles to wait for */
                wait_loop = (ADC_TEMPSENSOR_DELAYTIME * (SystemCoreClock / 1000000));
                while(wait_loop != 0){
                    wait_loop--;
                }
            } 
        }
    }

