SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC and start the conversion of inserted group
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_start(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc_dev] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc)){
        /* set ADC state  */
        _adc_state_clear(adc, ADC_STATE_READY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_EOC);
        _adc_state_set(adc, ADC_STATE_INSERTED_BUSY);
        /* check if a regular conversion is ongoing */
        if(RESET == ((hal_adc_state_get(adc)) & ADC_STATE_REGULAR_BUSY)){
            adc->error_state = ADC_ERROR_NONE;
        }
        
        /* clear ADC flag */
        adc_flag_clear(ADC_FLAG_EOIC);

        if(RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV){
            if(ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER){
                /* enable software trigger */
                adc_external_trigger_config(ADC_INSERTED_CHANNEL, ENABLE);
                adc_software_trigger_enable(ADC_INSERTED_CHANNEL);
            }else{
                /* enable external trigger */
                adc_external_trigger_config(ADC_INSERTED_CHANNEL, ENABLE);
            }
        }
    }else{
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of inserted group and disable ADC
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_stop(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    /* regular group is not busy and automatic convert is set */   
    if((RESET ==((hal_adc_state_get(adc)) & ADC_STATE_REGULAR_BUSY)) && (SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV)){
        /* if ADC is disabled */
        if(HAL_ERR_NONE == _adc_disable(adc)){
            /* set ADC state  */
            _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
            _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
            _adc_state_set(adc, ADC_STATE_READY);
        }
    }else{
        _adc_error_set(adc, ADC_ERROR_CONFIG);
        return HAL_ERR_NO_SUPPORT;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      polling for ADC inserted group conversion, this function is just for single conversion 
                (scan mode disabled or scan mode enabled with the length of inserted channel is 1).
    \param[in]  adc: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: time out duration in milliscond
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_conversion_poll(hal_adc_dev_struct *adc, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* set timeout */
    tick_start = hal_basetick_count_get();

    /* if single conversion: scan mode disabled or enabled with length = 1 */
    if((RESET == __HAL_ADC_GET_SCAN_MODE) &&(RESET == __HAL_ADC_GET_INSERTEDCH_LENGTH)){
        /* wait until end of inserted channel conversion flag is raised */
        while(RESET == adc_flag_get(ADC_FLAG_EOIC)){
            /* check for the timeout */
            if(HAL_TIMEOUT_FOREVER != timeout_ms){
                if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                    _adc_state_set(adc, ADC_STATE_TIMEOUT);
                    /* when timeout occurs, output timeout warning message */
                    HAL_DEBUGW("adc inserted conversion poll timeout");
                    return HAL_ERR_TIMEOUT;
                }            
            }
        }
    }else{
        return HAL_ERR_NO_SUPPORT;
    }

    /* clear ADC EOIC/STIC/EOC flag */
    adc_flag_clear(ADC_FLAG_EOIC);
    adc_flag_clear(ADC_FLAG_STIC);
    adc_flag_clear(ADC_FLAG_EOC);

    /* set ADC state */
    _adc_state_set(adc, ADC_STATE_INSERTED_EOC);
    
    if((ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER) ||((RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) \
        && ((ADC_EXTTRIG_REGULAR_NONE == __HAL_ADC_GET_REGULARCH_EXTTRIGGER) && (RESET == __HAL_ADC_GET_CONTINUOUS_MODE)))){
       /* set ADC state */
       _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
        if(RESET == ((hal_adc_state_get(adc)) & ADC_STATE_REGULAR_BUSY)){
           _adc_state_set(adc, ADC_STATE_READY);
       }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC inserted group software trigger
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
/*  */
void hal_adc_inserted_software_trigger_enable(hal_adc_dev_struct *adc)
{
    adc_software_trigger_enable(ADC_INSERTED_CHANNEL);
}

/*!
    \brief      start ADC EOIC interrupt
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: EOIC interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_HARDWARE, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_start_interrupt(hal_adc_dev_struct *adc, hal_adc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_irq) ){
        HAL_DEBUGE("pointer [adc] or [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

