SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    /* if ADC is enabled */
    if(HAL_ERR_NONE == _adc_enable(adc)){
        _adc_state_clear(adc, ADC_STATE_READY);
        _adc_state_clear(adc, ADC_STATE_INSERTED_EOC);
        _adc_state_set(adc, ADC_STATE_INSERTED_BUSY);
        
        /* check if an inserted conversion is ongoing */
        if(RESET == ((hal_adc_state_get(adc)) & ADC_STATE_REGULAR_BUSY)){
            adc->error_state = ADC_ERROR_NONE;
        }

        adc->adc_irq.adc_eoic_handle = p_irq->adc_eoic_handle;
        /* clear ADC interrupt flag */
        adc_interrupt_flag_clear(ADC_INT_FLAG_EOIC);
        /* enable ADC end of group conversion flag */
        adc_interrupt_enable(ADC_INT_EOIC);
        
        /* check if inserted group external trigger is enable*/
        if(RESET == ((ADC_CTL1) & (ADC_CTL1_ETEIC))){
            /* enable software trigger */
            adc_external_trigger_config(ADC_INSERTED_CHANNEL, ENABLE);
        }
        if(RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV){
            if(ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER){
                /* enable software trigger */
                adc_software_trigger_enable(ADC_INSERTED_CHANNEL);
            }
        }
    }else{
        return HAL_ERR_HARDWARE;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      stop the conversion of inserted group and disable ADC
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_NO_SUPPORT, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_inserted_stop_interrupt(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* regular group is not busy and automatic convert is set */   
    if((RESET ==((hal_adc_state_get(adc)) & ADC_STATE_REGULAR_BUSY)) && (SET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV)){
        /* if ADC is disabled */
        if(HAL_ERR_NONE == _adc_disable(adc)){
            /* disable end of inserted group conversion interrupt */
            adc_interrupt_disable(ADC_INT_EOIC);
            adc->adc_irq.adc_eoic_handle = NULL;

            /* set ADC state */;
            _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
            _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
            _adc_state_set(adc, ADC_STATE_READY);
        }
    }else{
        _adc_error_set(adc, ADC_ERROR_CONFIG);
        return HAL_ERR_NO_SUPPORT;
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      adc watchdog config
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_watchdog: the pointer of ADC watchdog configuration structure
                  watchdog_mode:
                    the argument could be selected from enumeration <hal_adc_watchdog_mode_enum>
                  single_channel: ADC_CHANNEL_x(x=0..9,16,17)
                  low_threshold: analog watchdog low threshold, 0..4095
                  high_threshold: analog watchdog high threshold, 0..4095
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_watchdog_config(hal_adc_dev_struct *adc, hal_adc_watchdog_struct *p_watchdog)
{
    uint32_t mode_temp, reg_temp;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_watchdog)){
        HAL_DEBUGE("pointer [adc] or [p_watchdog] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    reg_temp = ADC_CTL0;
    reg_temp &= (uint32_t)~(ADC_CTL0_RWDEN | ADC_CTL0_IWDEN | ADC_CTL0_WDSC);
    mode_temp = p_watchdog->watchdog_mode;

    /* select watchdog mode mode */ 
    if((ADC_WATCHDOG_SINGLE_REGULAR == mode_temp) || (ADC_WATCHDOG_SINGLE_INSERTED == mode_temp)|| (ADC_WATCHDOG_SINGLE_REGINS == mode_temp)){
        /* set watchdog single channel */ 
        reg_temp &= (uint32_t)(~ADC_CTL0_WDCHSEL);
        reg_temp |= (uint32_t)(p_watchdog->single_channel);
        reg_temp |= (uint32_t)mode_temp;
    }else{
        reg_temp |= (uint32_t)mode_temp;
    }
    ADC_CTL0 = reg_temp;

    /* ADC analog watchdog low threshold */
    ADC_WDLT = (uint32_t)WDLT_WDLT(p_watchdog->low_threshold);
    /* ADC analog watchdog high threshold */
    ADC_WDHT = (uint32_t)WDHT_WDHT(p_watchdog->high_threshold);

    return HAL_ERR_NONE;
}

/*!
    \brief      enable ADC watchdog interrupt
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: watchdog interrupt callback function structure
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_watchdog_interrupt_enable(hal_adc_dev_struct *adc, hal_adc_irq_struct *p_irq)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if((NULL == adc) || (NULL == p_irq)){
        HAL_DEBUGE("pointer [adc] or [p_irq] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    /* ADC analog watchdog interrupt handle config */
    adc->adc_irq.adc_watchdog_handle = p_irq->adc_watchdog_handle;
    /* clear ADC watchdog interrupt flag */
    adc_interrupt_flag_clear(ADC_INT_FLAG_WDE);
    /* enable ADC watchdog interrupt */
    adc_interrupt_enable(ADC_INT_WDE);
    
    return HAL_ERR_NONE;
}

/*!
    \brief      disable ADC watchdog interrupt
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_watchdog_interrupt_disable(hal_adc_dev_struct *adc)
{
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

