SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    /* disable ADC watchdog interrupt */
    adc_interrupt_disable(ADC_INT_WDE);
    /* ADC analog watchdog interrupt handle config */
    adc->adc_irq.adc_watchdog_handle = NULL;
    
    return HAL_ERR_NONE;
}

/*!
    \brief      polling for watchdog event
    \param[in]  adc: ADC device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  timeout_ms: time out duration in milliscond
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
int32_t hal_adc_watchdog_event_poll(hal_adc_dev_struct *adc, uint32_t timeout_ms)
{
    uint32_t tick_start = 0;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */

    /* set timeout */
    tick_start = hal_basetick_count_get();

    /* check watchdog event flag */
    while(RESET == adc_flag_get(ADC_FLAG_WDE)){
        /* check for the timeout */
        if(HAL_TIMEOUT_FOREVER != timeout_ms){
            if(SET == hal_basetick_timeout_check(tick_start, timeout_ms)){
                _adc_state_set(adc, ADC_STATE_TIMEOUT);
                /* when timeout occurs, output timeout warning message */
                HAL_DEBUGW("adc watchdog event poll timeout");
                return HAL_ERR_TIMEOUT;
            }
        }
    }
    
    /* set ADC state */
    _adc_state_set(adc, ADC_STATE_WATCHDOG);
    
    /* clear ADC analog watchdog event flag */
    adc_flag_clear(ADC_FLAG_WDE);

    return HAL_ERR_NONE;
}

/*!
    \brief      ADC interrupt handler content function, which is merely used in ADC_CMP_IRQHandler
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_adc_irq(hal_adc_dev_struct *adc)
{
    /* EOC interrupt handler */
    if(SET == (adc_interrupt_flag_get(ADC_INT_FLAG_EOC))){
        /* clear EOC flag */
        adc_interrupt_flag_clear(ADC_INT_FLAG_EOC);
            if(NULL != (adc->adc_irq.adc_eoc_handle)){
            adc->adc_irq.adc_eoc_handle(adc);
        }
        /* if not in error state */
        if(SET == ((hal_adc_error_get(adc)) & ADC_ERROR_SYSTEM)){
            _adc_state_set(adc, ADC_STATE_REGULAR_EOC);
        }

        if((ADC_EXTTRIG_REGULAR_NONE == __HAL_ADC_GET_REGULARCH_EXTTRIGGER)&&(RESET == __HAL_ADC_GET_CONTINUOUS_MODE)){
            adc_interrupt_disable(ADC_INT_EOC);
            /* set ADC state */
            _adc_state_clear(adc, ADC_STATE_REGULAR_BUSY);
            if(RESET == ((hal_adc_state_get(adc)) & ADC_STATE_INSERTED_BUSY)){
                _adc_state_set(adc, ADC_STATE_READY);
            }
        }
    }
    /* EOIC interrupt handler */
    if(SET == (adc_interrupt_flag_get(ADC_INT_FLAG_EOIC))){
        /* clear EOIC flag */
        adc_interrupt_flag_clear(ADC_INT_FLAG_EOIC);
        if(NULL != (adc->adc_irq.adc_eoic_handle)){
            adc->adc_irq.adc_eoic_handle(adc);
        }
        /* if not in error state */
        if(SET == ((hal_adc_error_get(adc)) & ADC_ERROR_SYSTEM)){
            _adc_state_set(adc, ADC_STATE_INSERTED_EOC);
        }

        if((ADC_EXTTRIG_INSERTED_NONE == __HAL_ADC_GET_INSERTEDCH_EXTTRIGGER) ||((RESET == __HAL_ADC_GET_INSERTEDCH_AUTOCONV) \
            && ((ADC_EXTTRIG_REGULAR_NONE == __HAL_ADC_GET_REGULARCH_EXTTRIGGER) && (RESET == __HAL_ADC_GET_CONTINUOUS_MODE)))){
            adc_interrupt_disable(ADC_INT_EOIC);
            /* set ADC state */
            _adc_state_clear(adc, ADC_STATE_INSERTED_BUSY);
            if(RESET == ((hal_adc_state_get(adc)) & ADC_STATE_REGULAR_BUSY)){
                _adc_state_set(adc, ADC_STATE_READY);
            }
        }
    }
    /* watchdog interrupt handler */
    if(SET == (adc_interrupt_flag_get(ADC_INT_FLAG_WDE))){
        /* clear watchdog flag */
        adc_interrupt_flag_clear(ADC_INT_FLAG_WDE);
        if(NULL != (adc->adc_irq.adc_watchdog_handle)){
            adc->adc_irq.adc_watchdog_handle(adc);
        }
        /* set ADC state */
        _adc_state_set(adc, ADC_STATE_WATCHDOG);
    }
}

/*!
    \brief      set user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  p_irq: point to ADC interrupt callback functions structure
      \arg        hal_irq_handle_cb function pointer: the function is user-defined,
                    the corresponding callback mechanism is in use, and enable corresponding interrupt
      \arg        NULL: The corresponding callback mechanism is out of use, and
                    disable corresponding interrupt
      \arg        HAL_INTERRUPT_ENABLE_ONLY: The corresponding callback mechanism is out of use, 
                    while enable corresponding interrupt
    \param[out] none
    \retval     none
*/
void hal_adc_irq_handle_set(hal_adc_dev_struct *adc, hal_adc_irq_struct *p_irq)
{
    /* EOC interrupt handler set */
    if(NULL != p_irq->adc_eoc_handle){
        adc->adc_irq.adc_eoc_handle = p_irq->adc_eoc_handle;
        adc_interrupt_enable(ADC_INT_EOC);
    }else{
        adc->adc_irq.adc_eoc_handle = NULL;
        adc_interrupt_enable(ADC_INT_EOC);
    }
    /* EOIC interrupt handler set */
    if(NULL != p_irq->adc_eoic_handle){
        adc->adc_irq.adc_eoic_handle = p_irq->adc_eoic_handle;
        adc_interrupt_enable(ADC_INT_EOIC);
    }else{
        adc->adc_irq.adc_eoic_handle = NULL;
        adc_interrupt_disable(ADC_INT_EOIC);
    }
    /* watchdog interrupt handler set */
    if(NULL != p_irq->adc_watchdog_handle){
        adc->adc_irq.adc_watchdog_handle = p_irq->adc_watchdog_handle;
        adc_interrupt_enable(ADC_INT_WDE);
    }else{
        adc->adc_irq.adc_watchdog_handle = NULL;
        adc_interrupt_disable(ADC_INT_WDE);
    }
}

/*!
    \brief      reset all user-defined interrupt callback function, 
                which will be registered and called when corresponding interrupt be triggered
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
void hal_adc_irq_handle_all_reset(hal_adc_dev_struct *adc)
{
    /* ADC interrupt handler reset */
    adc->adc_irq.adc_watchdog_handle = NULL;
    adc->adc_irq.adc_eoc_handle      = NULL;
    adc->adc_irq.adc_eoic_handle     = NULL;
}

/*!
    \brief      get ADC regular group conversion result
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the regular group conversion result(0-0xFFFF)
*/
uint16_t hal_adc_regular_value_get(hal_adc_dev_struct *adc)
{
    /* return ADC regular group converted value */ 
    return ((uint16_t)ADC_RDATA);
}

/*!
    \brief      get ADC inserted group conversion result
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the inserted group conversion result(0-0xFFFF)
*/
uint16_t hal_adc_inserted_value_get(hal_adc_dev_struct *adc, uint8_t inschannel_sequence)
{
    uint16_t idata_temp = 0;

