SIGS618/GD32IDE-Project---Learn/firmware/GD32E23x_hal_peripheral/Source/gd32e23x_hal_adc.c
    /* clear ADC interrupt flag */
    adc_flag_clear(ADC_FLAG_EOIC);

    /* read ADC converted value */ 
    idata_temp = adc_inserted_data_read(inschannel_sequence);
    
    /* return ADC converted value */ 
    return idata_temp;
}

/*!
    \brief      get ADC error
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the error state
*/
uint32_t hal_adc_error_get(hal_adc_dev_struct *adc)
{
    /* return ADC error */
    return (adc->error_state);
}

/*!
    \brief      get ADC state
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the state
*/
uint32_t hal_adc_state_get(hal_adc_dev_struct *adc)
{
    /* return ADC state */
    return (adc->state);
}

/*!
    \brief      enable the ADC
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
static int32_t _adc_enable(hal_adc_dev_struct *adc)
{
    uint32_t tick_start = 0;
    
#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    /* if ADC is disabled */
    if(RESET == _adc_enable_state_get()){
        /* enable ADC */
        adc_enable();
        /* wait for ADC enable */
        hal_basetick_delay_ms(1U);
        
        tick_start = hal_basetick_count_get();
        
        /* wait for ADC actually enabled */
        while(RESET == _adc_enable_state_get()){
            if(SET == hal_basetick_timeout_check(tick_start, ADC_ENABLE_DELAYTIME)){
                _adc_error_set(adc, ADC_ERROR_SYSTEM);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      disable the ADC
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     HAL_ERR_NONE, HAL_ERR_ADDRESS, HAL_ERR_TIMEOUT, details refer to gd32e23x_hal.h
*/
static int32_t _adc_disable(hal_adc_dev_struct *adc)
{
    uint32_t tick_start = 0;

#if (1 == HAL_PARAMETER_CHECK)
    /* check the parameters */
    if(NULL == adc){
        HAL_DEBUGE("pointer [adc] address is invalid");
        return HAL_ERR_ADDRESS;
    }
#endif /* 1 = HAL_PARAMETER_CHECK */
    
    /* if ADC is not already disabled */
    if(RESET != _adc_enable_state_get()){
        /* disable ADC */
        adc_disable();
        
        /* wait for ADC disable */
        tick_start = hal_basetick_count_get();
        
        /* wait for ADC actually disabled */
        while(RESET != _adc_enable_state_get()){
            if(SET == hal_basetick_timeout_check(tick_start, ADC_ENABLE_DELAYTIME)){
                _adc_error_set(adc, ADC_ERROR_SYSTEM);
                return HAL_ERR_TIMEOUT;
            }
        }
    }

    return HAL_ERR_NONE;
}

/*!
    \brief      get ADC enable state
    \param[in]  adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     the enable state: SET or RESET
*/
static FlagStatus _adc_enable_state_get(void)
{
    if(0U !=(ADC_CTL1 & ADC_CTL1_ADCON)){
        return SET;
    }else{
        return RESET;
    }
}

/*!
    \brief      ADC DMA transmission complete callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _adc_dma_transfer_complete(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_adc_dev_struct *p_adc;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_adc = (hal_adc_dev_struct*)(p_dma->p_periph);

    if(RESET == ((hal_adc_error_get(p_adc)) & (ADC_ERROR_DMA | ADC_ERROR_SYSTEM))){
        /* set ADC state */
        _adc_state_set(p_adc, ADC_STATE_REGULAR_EOC);

        if((ADC_EXTTRIG_REGULAR_NONE == __HAL_ADC_GET_REGULARCH_EXTTRIGGER)&&(DISABLE == __HAL_ADC_GET_CONTINUOUS_MODE)){
          /* set ADC state */
          _adc_state_clear(p_adc, ADC_STATE_REGULAR_BUSY);
          if(RESET == ((hal_adc_state_get(p_adc)) & ADC_STATE_INSERTED_BUSY)){
              _adc_state_set(p_adc, ADC_STATE_READY);
          }
        }

        if(NULL != (p_adc->adc_dma.transcom_handle)){
            p_adc->adc_dma.transcom_handle(p_adc);
        }
    }
}

/*!
    \brief      ADC DMA error callback
    \param[in]  dma: DMA device information structrue
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[out] none
    \retval     none
*/
static void _adc_dma_error(void *dma)
{
    hal_dma_dev_struct *p_dma;
    hal_adc_dev_struct *p_adc;
    
    p_dma = (hal_dma_dev_struct*)dma;
    p_adc = (hal_adc_dev_struct*)p_dma->p_periph;
    
    if(NULL != (p_adc->adc_dma.error_handle)){
        p_adc->adc_dma.error_handle(p_adc);
    }
    
    /* set ADC state and error */
    _adc_error_set(p_adc, ADC_ERROR_DMA);
}

/*!
    \brief      set ADC state
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_state_enum>
    \param[out] none
    \retval     the ADC state
*/
static void _adc_state_set(hal_adc_dev_struct *d_adc, hal_adc_state_enum adc_state)
{
    /* set ADC state */
    d_adc->state |= (adc_state);
}

/*!
    \brief      clear ADC state
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_state_enum>
    \param[out] none
    \retval     the ADC state
*/
static void _adc_state_clear(hal_adc_dev_struct *d_adc, hal_adc_state_enum adc_state)
{
    /* clear ADC state */
    d_adc->state &= ~(adc_state);
}

/*!
    \brief      set ADC error
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_error_enum>
    \param[out] none
    \retval     the ADC error
*/
static void _adc_error_set(hal_adc_dev_struct *d_adc, hal_adc_error_enum adc_error)
{
    /* set ADC error */
    d_adc->error_state |= (adc_error);
}

/*!
    \brief      clear ADC error
    \param[in]  d_adc: ADC device information structure
                  the structure is not necessary to be reconfigured after structrue initialization,
                  the structure parameters altering is automatically configured by core
    \param[in]  adc_state: the state of ADC
                  the argument could be selected from enumeration <hal_adc_error_enum>
    \param[out] none
    \retval     the ADC error
*/
static void _adc_error_clear(hal_adc_dev_struct *d_adc, hal_adc_error_enum adc_error)
{
    /* clear ADC error */
    d_adc->error_state &= ~(adc_error);
}
